export default {
  header: {
    howToUse: 'Использование',
    addStyle: 'Добавить стиль',
    login: 'Вход',
    logout: 'Выход'
  },
  howToUse: {
    title: 'Как использовать эти стили?',
    1: {
      text: 'Установите расширение, которое будет добавлять стили на страницы.',
      browserDetected:
        'Похоже, что вы используете браузер {0}. Установите расширения для {1} или выберите браузер вручную:',
      browserNotDetected: 'Выберите расширение в зависимости от вашего браузера:'
    },
    2: "Выберите стиль и нажмите установить, расширение предложит установить новый usercss, намите 'Установить'",
    3: 'Стиль установлен и готов к использованию',
    close: 'Понятно!'
  },
  addStyle: {
    title: 'Добавить новый стиль',
    placeholder: 'Ссылка на GitHub репозиторий',
    close: 'Не сейчас',
    submit: 'Добавить'
  },
  features: {
    1: {
      title: 'Автоматическое обновление',
      text: 'Установите один раз и получайте обновления автоматически'
    },
    2: {
      title: 'Свободное распространение',
      text: 'Любой желающий может добавить свой стиль'
    },
    3: {
      title: 'Открытый исходный код',
      text: 'Устанавливайте прямо из репозитория'
    }
  },
  search: {
    title: 'Поиск стилей',
    placeholder: 'Поиск по названию или автору...',
    label: 'Очистить поле поиска'
  },
  styles: {
    title: 'Стили',
    by: '',
    clearOwnerLabel: 'Очистить фильтр по автору'
  },
  sort: {
    add: 'Недавно добавленные',
    update: 'Недавно обновленные',
    stars: 'Самые популярные'
  },
  styleInfo: {
    updated: 'Обновлен',
    install: 'Установить',
    edit: {
      title: 'Редатировать стиль',
      namePlaceholder: 'Style name',
      previewPlaceholder: 'Preview url',
      button: 'Сохранить'
    },
    delete: {
      title: 'Удалить стиль',
      text:
        'Имейте в виду, что он может быть добавлен повторно. Если вы не хотите, чтобы ваш стиль размещался на этом сайте — пожалуйста {0}.',
      contact: 'свяжитесь с нами',
      button: 'Удалить'
    }
  },
  privacy: {
    title: 'Политика конфиденциальности',
    main:
      'Этот документ политики конфиденциальности содержит типы информации, собираемой и сохраняемой StyleBase, доступной на https://stylebase.cc, и способы ее использования. Если у вас есть дополнительные вопросы или вам нужна дополнительная информация о нашей Политике конфиденциальности, обращайтесь к нам по электронной почте по адресу {0}.',
    information: {
      title: 'Информация, которую мы собираем',
      text:
        'Личная информация, которую вас просят предоставить, и причины, по которым вас просят предоставить ее, будут разъяснены вам в тот момент, когда мы попросим вас предоставить вашу личную информацию. Если вы свяжетесь с нами, мы можем получить дополнительную информацию о вас, такую как ваше имя, адрес электронной почты, содержание сообщения и/или вложения, которые вы можете нам отправить, а также любую другую информацию, которую вы можете предоставить.'
    },
    logs: {
      title: 'Лог-файлы',
      text:
        'StyleBase следует стандартной процедуре использования лог-файлов. Эти файлы регистрируют посетителей, когда они посещают веб-сайты. Информация, собираемая в лог-файлы, включает IP-адрес, тип браузера, интернет-провайдера, отметку даты и времени, страницы входа/выхода и, возможно, количество кликов. Эти данные не связаны с какой-либо информацией, позволяющей установить личность. Данные собираются для анализа тенденций, администрирования сайта и сбора демографической информации.'
    },
    cookies: {
      title: 'Файлы cookie',
      text: `Как и любой другой веб-сайт, StyleBase использует файлы cookie. Файлы cookie используются для хранения информации, включающей страницы веб-сайта, к которым пользователь получал доступ или посещал. Эта информация используется для оптимизации пользовательского опыта путем настройки содержимого веб-страниц на основе типа браузера пользователя и/или другой информации. Для получения дополнительной информации о файлах cookie прочтите статью "Что такое файлы cookie" {0}.`,
      website: 'на сайте Cookie Consent'
    },
    consent: {
      title: 'Согласие',
      text: 'Используя наш веб-сайт, вы тем самым соглашаетесь с нашей Политикой конфиденциальности.'
    },
    close: 'Закрыть'
  },
  footer: {
    contact: 'Связаться с нами',
    privacy: 'Политика конфиденциальности',
    code: 'Код на GitHub'
  }
};
